{
  "_name_or_path": "bert-base-multilingual-cased-language-detection",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Arabic",
    "1": "Basque",
    "2": "Breton",
    "3": "Catalan",
    "4": "Chinese_China",
    "5": "Chinese_Hongkong",
    "6": "Chinese_Taiwan",
    "7": "Chuvash",
    "8": "Czech",
    "9": "Dhivehi",
    "10": "Dutch",
    "11": "English",
    "12": "Esperanto",
    "13": "Estonian",
    "14": "French",
    "15": "Frisian",
    "16": "Georgian",
    "17": "German",
    "18": "Greek",
    "19": "Hakha_Chin",
    "20": "Indonesian",
    "21": "Interlingua",
    "22": "Italian",
    "23": "Japanese",
    "24": "Kabyle",
    "25": "Kinyarwanda",
    "26": "Kyrgyz",
    "27": "Latvian",
    "28": "Maltese",
    "29": "Mongolian",
    "30": "Persian",
    "31": "Polish",
    "32": "Portuguese",
    "33": "Romanian",
    "34": "Romansh_Sursilvan",
    "35": "Russian",
    "36": "Sakha",
    "37": "Slovenian",
    "38": "Spanish",
    "39": "Swedish",
    "40": "Tamil",
    "41": "Tatar",
    "42": "Turkish",
    "43": "Ukranian",
    "44": "Welsh"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Arabic": 0,
    "Basque": 1,
    "Breton": 2,
    "Catalan": 3,
    "Chinese_China": 4,
    "Chinese_Hongkong": 5,
    "Chinese_Taiwan": 6,
    "Chuvash": 7,
    "Czech": 8,
    "Dhivehi": 9,
    "Dutch": 10,
    "English": 11,
    "Esperanto": 12,
    "Estonian": 13,
    "French": 14,
    "Frisian": 15,
    "Georgian": 16,
    "German": 17,
    "Greek": 18,
    "Hakha_Chin": 19,
    "Indonesian": 20,
    "Interlingua": 21,
    "Italian": 22,
    "Japanese": 23,
    "Kabyle": 24,
    "Kinyarwanda": 25,
    "Kyrgyz": 26,
    "Latvian": 27,
    "Maltese": 28,
    "Mongolian": 29,
    "Persian": 30,
    "Polish": 31,
    "Portuguese": 32,
    "Romanian": 33,
    "Romansh_Sursilvan": 34,
    "Russian": 35,
    "Sakha": 36,
    "Slovenian": 37,
    "Spanish": 38,
    "Swedish": 39,
    "Tamil": 40,
    "Tatar": 41,
    "Turkish": 42,
    "Ukranian": 43,
    "Welsh": 44
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.20.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
